Autodesk.Revit.DB.DirectShapeCreationMode
Controls when to create a DirectShape while importing data via ATF.

Autodesk.Revit.DB.DirectShapeCreationMode.OneDirectShapePerTopLevelChild
Create one DirectShape for each top-level child.

Autodesk.Revit.DB.DirectShapeCreationMode.OneDirectShape
Create one DirectShape for the entire import.